# Все моды и вопросы к ним, и тексты историй

classic_mode = ['Кто/что?', 'С кем/чем?', 'Где?', 'Когда?', 'Как?', 'Что делали?', 'Зачем?', 'Почему?',
                'Что им сказали?', 'Чем все закончилось?']
# пустое поле для текста классического мода, потому что класс Story имеет 2 атрибута
classic_mode_text = []
questions_story1 = ['О чём?', 'Кого/что?', 'Какие они?', 'Кто они?', 'Что делала?', 'С кем?', 'Где?',
                    'Что он держал?', 'Нет кого его?', 'Что делать?', 'Каким?', 'Чем?', 'Куда?', 'О чём?']
text_story1 = ['После выпускного в посёлке городского типа бывшие одноклассники сидели в лесу у костра и разговаривали',
               '', ' .Всё это происходило из-за того, что им в шампанское добавили', '',
               '  . Они предавались ностальгии. С самого первого класса их называли', '', '',
               ' посёлка – такое приятно вспомнить.Все было очень душевно, пока Наташа не сказала ',
               '«Я ', '', '', '', '». Чтобы всех отвлечь, кому-то пришлось вытащить из кармана', '',
               'и кинуть прямо в ', '',
               ', который странным образом тоже был на этой встрече выпускников. Дима встал и начал', '',
               '. Он был таким', '', ', что Наташа стукнула его', '', ' , который лежал у костра.',
               'Все успокоились, обнялись и сели', '', ', чтобы помечтать', '', '.']
questions_story2 = ['Кто/что?', 'Кто/что?', 'Какой предмет?', 'Какому зданию?', 'Что сделать?' 
                    'Что сделать?', 'Какого?', 'Нет чего?', 'Каким?', 'Каким предметом?', 'Как?']
text_story2 = ['Даня, обычный парень из Купчино, жил обыденно, с девизом «лучше', '', ' в руке,',
               'чем ', '', ' в небе», ходил в школу и с карманных денег инвестировал в', '', '.',
               'Однажды он решил разнообразить свою рутину и отправиться к заброшенному', '',
               '.Двери там были замурованы, поэтому он решил', '', '  и', '',
               '.Забравшись в здание, он обрадовался и начал', '',
               '. За этим его и застали приверженцы секты', '', '', '', ' .',
               'Они начали окружать его и петь. В здании запахло', '', '', ', и Даня  сбежал оттуда', '',
               '. Он предпочел думать, что все это ему приснилось, но мы-то знаем правду.']
questions_story3 = ['Какая?', 'Кто она?', 'Как?', 'Какого действия?', 'Зачем?', 'Какого?', 'Какого животного?',
                    'Какими частями тела?', 'Какой предмет?', 'Куда?', 'Кто сделали?']
text_story3 = ['Утром ты и твоя', '', 'проснулись в палатке в лесу – вы поехали вместе в поход.',
               'Выглядели вы, надо сказать,', '', 'после', '', '.Вы решили выйти прогуляться, и прошли уже два метра,',
               'когда встретили', '', 'с гигантскими', '',
               '.Он хотел атаковать вас, но ты выхватил', '', ' , чтобы защититься. ',
               'Однако вместо этого ты зачем-то положил ваше оружие.',
               'Авторы этого проекта, честно говоря, не хотели бы поехать с тобой в лес после всей этой истории, ',
               'они бы лучше', '', '.']
questions_story4 = ['Какие?', 'Что?', 'Кого/что?', 'Какой предмет одежды?', 'Какое животное?',
                    'Каких предметов?', 'Кто/что?', 'Где?', 'Какая?', 'Каком виде транспорта?']
text_story4 = ['Наташа была обычной девушкой из села ', '', '', 'под Москвой. Ей хотелось от жизни большего, ',
               'поэтому она собрала ', '', 'и остальные необходимые вещи, надела', '', ',села на', '',
               ' и поехала покорять столицу.На дороге она нашла много шоколадных', '', '  и съела их. ',
               'Увидев это, ', '', ', встретившийся с ней по дороге,', '',
               ', сказал, что она слишком', '', ' , чтобы куда-либо ехать. ',
               'Он забрал ее с собой и они на частном', '', ' уехали на Мальдивы.']
questions_story5 = ['Кем по профессии?', 'Кому?', 'Когда?', 'Где?', 'С кем?',
                    'Какую еду?', 'Какой?', 'За чем?', 'Без чего?', 'Что сделал?']
text_story5 = ['Стать известным на всю страну', '', '', 'удалось в рекордные сроки. Однажды он согласился на интервью.',
               'Оказалось, интервью будет парным – он окажется там', '',
               '. При входе журналист предложил ему', '', ', но он отказался,сказав «я уже и так достаточно', '',
               ',извините». Наш герой удобно присел', '', ', где для него приготовили место', '',
               ', но вдруг понял, что не хочет интервью, а хочет начать новую жизнь, без популярности и', '',
               '.Он встал и стремительно', '', '.']


dictionary = {'Кто/что?': ' Ричард Львиное Сердце', 'С кем?': 'с Ольгой Бузовой',
              'С кем/чем?': ' с Нурланом Сабуровым', 'Как?': ' неожиданно',
              'Что делали?': ' ждали рассвета, варили борщ',
              'Почему?': ' потому что иначе нельзя, потому что лаяли собаки',
              'Что им сказали?': ' им сказали «идите спать»)',
              'Чем все закончилось?': ' всё закончилось индийским танцем)',
              'О чём?': ' о стаканах', 'Кого/что?': ' экстракт пробок', 'Кто они?': ' инвесторы',
              'Что делала?': ' грызла сапог', 'Что он держал?': ' зарядку для телефона', 'Нет кого его?': ' попугая',
              'Что делать?': ' петь Меладзе', 'Каким?': ' луковым', 'Чем?': ' топором', 'Куда?': ' на полку',
              'Какой предмет?': ' заколку', 'Какому зданию?': ' зданию библиотеки книг про котиков',
              'Что сделать?': ' облизнуть колено', 'Чем заниматься?': ' плясать вприсядку', 'Какого?': ' колючего',
              'Нет чего?': ' вагона метро', 'Каким предметом?': ' топором', 'Какая?': ' похожая на ватрушку',
              'Кто она?': ' продавщица пирожков', 'Какого действия?': ' индийской дискотеки',
              'Зачем?': ' чтобы соблазнить моргенштерна', 'Какого животного?': ' червя',
              'Какими частями тела?': ' руками', 'Что сделали?': ' переплыли Босфор',
              'Какие?': ' дифференциальные', 'Что?': ' утюжки', 'Какой предмет одежды?': ' зелёную портупею',
              'На какое животное?': ' на хромую козу', 'Каких предметов?': ' крючков для вязания', 'Где?': ' на болоте',
              'Каком виде транспорта?': ' автобусе', 'Кем по профессии?': ' оценщиком запаха изо рта',
              'Кому?': ' Ивану Урганту', 'Когда?': ' после брачного периода сов', 'Какую еду?': ' тушеные кабачки',
              'Какой?': ' ироничный', 'За чем?': ' за раковиной', 'Без чего?': ' без красных стрингов',
              'Что сделал?': ' уснул', 'Кто?': ' Егор Крид',  'Какие они?': 'красивые'}
